---
kind: type
id: T:Autodesk.Revit.DB.ImportIFCOptions
source: html/bddda5ab-6448-89f1-edea-912254b524f5.htm
---
# Autodesk.Revit.DB.ImportIFCOptions

Provides access to settings that control linking and opening IFC files.

## Syntax (C#)
```csharp
public class ImportIFCOptions : IDisposable
```

## Remarks
These settings are stored in the Revit.ini file. All documents in Revit instances which use this Revit.ini will follow these settings.